MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/rcon.h
/*
 * Component description for RCON
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-10-17T09:05:02Z */
#ifndef _BZ45_RCON_COMPONENT_H_
#define _BZ45_RCON_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR RCON                                         */
/* ************************************************************************** */

/* -------- RCON_RCON : (RCON Offset: 0x30) (R/W 32) RESET CONTROL REGISTER -------- */
#define RCON_RCON_RESETVALUE                  _UINT32_(0x03)                                       /*  (RCON_RCON) RESET CONTROL REGISTER  Reset Value */

#define RCON_RCON_POR_Pos                     _UINT32_(0)                                          /* (RCON_RCON) Power-On Reset Flag bit Position */
#define RCON_RCON_POR_Msk                     (_UINT32_(0x1) << RCON_RCON_POR_Pos)                 /* (RCON_RCON) Power-On Reset Flag bit Mask */
#define RCON_RCON_POR(value)                  (RCON_RCON_POR_Msk & (_UINT32_(value) << RCON_RCON_POR_Pos)) /* Assigment of value for POR in the RCON_RCON register */
#define   RCON_RCON_POR_POR_Val               _UINT32_(0x1)                                        /* (RCON_RCON) A Power-up Reset has occurred.  */
#define   RCON_RCON_POR_NO_POR_Val            _UINT32_(0x0)                                        /* (RCON_RCON) A Power-up Reset has not occurred.  */
#define RCON_RCON_POR_POR                     (RCON_RCON_POR_POR_Val << RCON_RCON_POR_Pos)         /* (RCON_RCON) A Power-up Reset has occurred. Position  */
#define RCON_RCON_POR_NO_POR                  (RCON_RCON_POR_NO_POR_Val << RCON_RCON_POR_Pos)      /* (RCON_RCON) A Power-up Reset has not occurred. Position  */
#define RCON_RCON_BOR_Pos                     _UINT32_(1)                                          /* (RCON_RCON) Brown-out Reset Flag bit Position */
#define RCON_RCON_BOR_Msk                     (_UINT32_(0x1) << RCON_RCON_BOR_Pos)                 /* (RCON_RCON) Brown-out Reset Flag bit Mask */
#define RCON_RCON_BOR(value)                  (RCON_RCON_BOR_Msk & (_UINT32_(value) << RCON_RCON_BOR_Pos)) /* Assigment of value for BOR in the RCON_RCON register */
#define   RCON_RCON_BOR_BOR_Val               _UINT32_(0x1)                                        /* (RCON_RCON) A Brown-out Reset has occurred.  */
#define   RCON_RCON_BOR_NO_BOR_Val            _UINT32_(0x0)                                        /* (RCON_RCON) A Brown-out Reset has not occurred.  */
#define RCON_RCON_BOR_BOR                     (RCON_RCON_BOR_BOR_Val << RCON_RCON_BOR_Pos)         /* (RCON_RCON) A Brown-out Reset has occurred. Position  */
#define RCON_RCON_BOR_NO_BOR                  (RCON_RCON_BOR_NO_BOR_Val << RCON_RCON_BOR_Pos)      /* (RCON_RCON) A Brown-out Reset has not occurred. Position  */
#define RCON_RCON_IDLE_Pos                    _UINT32_(2)                                          /* (RCON_RCON) Wake from Idle Flag bit Position */
#define RCON_RCON_IDLE_Msk                    (_UINT32_(0x1) << RCON_RCON_IDLE_Pos)                /* (RCON_RCON) Wake from Idle Flag bit Mask */
#define RCON_RCON_IDLE(value)                 (RCON_RCON_IDLE_Msk & (_UINT32_(value) << RCON_RCON_IDLE_Pos)) /* Assigment of value for IDLE in the RCON_RCON register */
#define   RCON_RCON_IDLE_IDLE_Val             _UINT32_(0x1)                                        /* (RCON_RCON) Device was in Idle mode.  */
#define   RCON_RCON_IDLE_NOT_IDLE_Val         _UINT32_(0x0)                                        /* (RCON_RCON) Device was not in Idle mode.  */
#define RCON_RCON_IDLE_IDLE                   (RCON_RCON_IDLE_IDLE_Val << RCON_RCON_IDLE_Pos)      /* (RCON_RCON) Device was in Idle mode. Position  */
#define RCON_RCON_IDLE_NOT_IDLE               (RCON_RCON_IDLE_NOT_IDLE_Val << RCON_RCON_IDLE_Pos)  /* (RCON_RCON) Device was not in Idle mode. Position  */
#define RCON_RCON_SLEEP_Pos                   _UINT32_(3)                                          /* (RCON_RCON) Wake from Sleep Flag bit Position */
#define RCON_RCON_SLEEP_Msk                   (_UINT32_(0x1) << RCON_RCON_SLEEP_Pos)               /* (RCON_RCON) Wake from Sleep Flag bit Mask */
#define RCON_RCON_SLEEP(value)                (RCON_RCON_SLEEP_Msk & (_UINT32_(value) << RCON_RCON_SLEEP_Pos)) /* Assigment of value for SLEEP in the RCON_RCON register */
#define   RCON_RCON_SLEEP_SLEEP_Val           _UINT32_(0x1)                                        /* (RCON_RCON) Device has been in Sleep mode.  */
#define   RCON_RCON_SLEEP_NOT_SLEEP_Val       _UINT32_(0x0)                                        /* (RCON_RCON) Device has not been in Sleep mode.  */
#define RCON_RCON_SLEEP_SLEEP                 (RCON_RCON_SLEEP_SLEEP_Val << RCON_RCON_SLEEP_Pos)   /* (RCON_RCON) Device has been in Sleep mode. Position  */
#define RCON_RCON_SLEEP_NOT_SLEEP             (RCON_RCON_SLEEP_NOT_SLEEP_Val << RCON_RCON_SLEEP_Pos) /* (RCON_RCON) Device has not been in Sleep mode. Position  */
#define RCON_RCON_WDTO_Pos                    _UINT32_(4)                                          /* (RCON_RCON) Watchdog Timer Time-Out Flag bit Position */
#define RCON_RCON_WDTO_Msk                    (_UINT32_(0x1) << RCON_RCON_WDTO_Pos)                /* (RCON_RCON) Watchdog Timer Time-Out Flag bit Mask */
#define RCON_RCON_WDTO(value)                 (RCON_RCON_WDTO_Msk & (_UINT32_(value) << RCON_RCON_WDTO_Pos)) /* Assigment of value for WDTO in the RCON_RCON register */
#define   RCON_RCON_WDTO_WDTO_Val             _UINT32_(0x1)                                        /* (RCON_RCON) WDT Time-out has occurred and caused a reset.  */
#define   RCON_RCON_WDTO_NOT_WDTO_Val         _UINT32_(0x0)                                        /* (RCON_RCON) WDT Time-out has not occurred.  */
#define RCON_RCON_WDTO_WDTO                   (RCON_RCON_WDTO_WDTO_Val << RCON_RCON_WDTO_Pos)      /* (RCON_RCON) WDT Time-out has occurred and caused a reset. Position  */
#define RCON_RCON_WDTO_NOT_WDTO               (RCON_RCON_WDTO_NOT_WDTO_Val << RCON_RCON_WDTO_Pos)  /* (RCON_RCON) WDT Time-out has not occurred. Position  */
#define RCON_RCON_DMTO_Pos                    _UINT32_(5)                                          /* (RCON_RCON) Deadman Timer Time-Out Flag bit Position */
#define RCON_RCON_DMTO_Msk                    (_UINT32_(0x1) << RCON_RCON_DMTO_Pos)                /* (RCON_RCON) Deadman Timer Time-Out Flag bit Mask */
#define RCON_RCON_DMTO(value)                 (RCON_RCON_DMTO_Msk & (_UINT32_(value) << RCON_RCON_DMTO_Pos)) /* Assigment of value for DMTO in the RCON_RCON register */
#define   RCON_RCON_DMTO_DMTO_Val             _UINT32_(0x1)                                        /* (RCON_RCON) DMT Time-out has occurred and caused a reset.  */
#define   RCON_RCON_DMTO_NOT_DMTO_Val         _UINT32_(0x0)                                        /* (RCON_RCON) DMT Time-out has not occurred.  */
#define RCON_RCON_DMTO_DMTO                   (RCON_RCON_DMTO_DMTO_Val << RCON_RCON_DMTO_Pos)      /* (RCON_RCON) DMT Time-out has occurred and caused a reset. Position  */
#define RCON_RCON_DMTO_NOT_DMTO               (RCON_RCON_DMTO_NOT_DMTO_Val << RCON_RCON_DMTO_Pos)  /* (RCON_RCON) DMT Time-out has not occurred. Position  */
#define RCON_RCON_SWR_Pos                     _UINT32_(6)                                          /* (RCON_RCON) Software Reset Flag bit Position */
#define RCON_RCON_SWR_Msk                     (_UINT32_(0x1) << RCON_RCON_SWR_Pos)                 /* (RCON_RCON) Software Reset Flag bit Mask */
#define RCON_RCON_SWR(value)                  (RCON_RCON_SWR_Msk & (_UINT32_(value) << RCON_RCON_SWR_Pos)) /* Assigment of value for SWR in the RCON_RCON register */
#define   RCON_RCON_SWR_SWR_Val               _UINT32_(0x1)                                        /* (RCON_RCON) A Software Commanded Reset has occurred.  */
#define   RCON_RCON_SWR_NOT_SWR_Val           _UINT32_(0x0)                                        /* (RCON_RCON) A Software Commanded Reset has not occurred.  */
#define RCON_RCON_SWR_SWR                     (RCON_RCON_SWR_SWR_Val << RCON_RCON_SWR_Pos)         /* (RCON_RCON) A Software Commanded Reset has occurred. Position  */
#define RCON_RCON_SWR_NOT_SWR                 (RCON_RCON_SWR_NOT_SWR_Val << RCON_RCON_SWR_Pos)     /* (RCON_RCON) A Software Commanded Reset has not occurred. Position  */
#define RCON_RCON_EXTR_Pos                    _UINT32_(7)                                          /* (RCON_RCON) External Reset (MCLR) Status bit Position */
#define RCON_RCON_EXTR_Msk                    (_UINT32_(0x1) << RCON_RCON_EXTR_Pos)                /* (RCON_RCON) External Reset (MCLR) Status bit Mask */
#define RCON_RCON_EXTR(value)                 (RCON_RCON_EXTR_Msk & (_UINT32_(value) << RCON_RCON_EXTR_Pos)) /* Assigment of value for EXTR in the RCON_RCON register */
#define   RCON_RCON_EXTR_EXTR_Val             _UINT32_(0x1)                                        /* (RCON_RCON) A Master Clear (pin) Reset has occurred.  */
#define   RCON_RCON_EXTR_NOT_EXTR_Val         _UINT32_(0x0)                                        /* (RCON_RCON) A Master Clear (pin) Reset has not occurred.  */
#define RCON_RCON_EXTR_EXTR                   (RCON_RCON_EXTR_EXTR_Val << RCON_RCON_EXTR_Pos)      /* (RCON_RCON) A Master Clear (pin) Reset has occurred. Position  */
#define RCON_RCON_EXTR_NOT_EXTR               (RCON_RCON_EXTR_NOT_EXTR_Val << RCON_RCON_EXTR_Pos)  /* (RCON_RCON) A Master Clear (pin) Reset has not occurred. Position  */
#define RCON_RCON_CMR_Pos                     _UINT32_(9)                                          /* (RCON_RCON) Configuration Mismatch Flag bit Position */
#define RCON_RCON_CMR_Msk                     (_UINT32_(0x1) << RCON_RCON_CMR_Pos)                 /* (RCON_RCON) Configuration Mismatch Flag bit Mask */
#define RCON_RCON_CMR(value)                  (RCON_RCON_CMR_Msk & (_UINT32_(value) << RCON_RCON_CMR_Pos)) /* Assigment of value for CMR in the RCON_RCON register */
#define   RCON_RCON_CMR_CMR_Val               _UINT32_(0x1)                                        /* (RCON_RCON) A Configuration Mismatch Reset Event has occurred.  */
#define   RCON_RCON_CMR_NOT_CMR_Val           _UINT32_(0x0)                                        /* (RCON_RCON) A Configuration Mismatch Reset Event has not occurred.  */
#define RCON_RCON_CMR_CMR                     (RCON_RCON_CMR_CMR_Val << RCON_RCON_CMR_Pos)         /* (RCON_RCON) A Configuration Mismatch Reset Event has occurred. Position  */
#define RCON_RCON_CMR_NOT_CMR                 (RCON_RCON_CMR_NOT_CMR_Val << RCON_RCON_CMR_Pos)     /* (RCON_RCON) A Configuration Mismatch Reset Event has not occurred. Position  */
#define RCON_RCON_DPSLP_Pos                   _UINT32_(10)                                         /* (RCON_RCON) DPSLP Deep Sleep Mode Flag Bit Position */
#define RCON_RCON_DPSLP_Msk                   (_UINT32_(0x1) << RCON_RCON_DPSLP_Pos)               /* (RCON_RCON) DPSLP Deep Sleep Mode Flag Bit Mask */
#define RCON_RCON_DPSLP(value)                (RCON_RCON_DPSLP_Msk & (_UINT32_(value) << RCON_RCON_DPSLP_Pos)) /* Assigment of value for DPSLP in the RCON_RCON register */
#define   RCON_RCON_DPSLP_DSLP_Val            _UINT32_(0x1)                                        /* (RCON_RCON) Deep Sleep Mode has occurred.  */
#define   RCON_RCON_DPSLP_NOT_DSLP_Val        _UINT32_(0x0)                                        /* (RCON_RCON) Deep Sleep Mode has not occurred.  */
#define RCON_RCON_DPSLP_DSLP                  (RCON_RCON_DPSLP_DSLP_Val << RCON_RCON_DPSLP_Pos)    /* (RCON_RCON) Deep Sleep Mode has occurred. Position  */
#define RCON_RCON_DPSLP_NOT_DSLP              (RCON_RCON_DPSLP_NOT_DSLP_Val << RCON_RCON_DPSLP_Pos) /* (RCON_RCON) Deep Sleep Mode has not occurred. Position  */
#define RCON_RCON_NVMEOL_Pos                  _UINT32_(24)                                         /* (RCON_RCON) NVM End of Life Flag Bit Position */
#define RCON_RCON_NVMEOL_Msk                  (_UINT32_(0x1) << RCON_RCON_NVMEOL_Pos)              /* (RCON_RCON) NVM End of Life Flag Bit Mask */
#define RCON_RCON_NVMEOL(value)               (RCON_RCON_NVMEOL_Msk & (_UINT32_(value) << RCON_RCON_NVMEOL_Pos)) /* Assigment of value for NVMEOL in the RCON_RCON register */
#define   RCON_RCON_NVMEOL_NO_NVMEOL_Val      _UINT32_(0x0)                                        /* (RCON_RCON) A NVM EOL Failure has not occurred.  */
#define   RCON_RCON_NVMEOL_NVMEOL_Val         _UINT32_(0x1)                                        /* (RCON_RCON) A NVM EOL Failure has occurred.  */
#define RCON_RCON_NVMEOL_NO_NVMEOL            (RCON_RCON_NVMEOL_NO_NVMEOL_Val << RCON_RCON_NVMEOL_Pos) /* (RCON_RCON) A NVM EOL Failure has not occurred. Position  */
#define RCON_RCON_NVMEOL_NVMEOL               (RCON_RCON_NVMEOL_NVMEOL_Val << RCON_RCON_NVMEOL_Pos) /* (RCON_RCON) A NVM EOL Failure has occurred. Position  */
#define RCON_RCON_NVMLTA_Pos                  _UINT32_(25)                                         /* (RCON_RCON) NVM Life Time Alert Flag Bit Position */
#define RCON_RCON_NVMLTA_Msk                  (_UINT32_(0x1) << RCON_RCON_NVMLTA_Pos)              /* (RCON_RCON) NVM Life Time Alert Flag Bit Mask */
#define RCON_RCON_NVMLTA(value)               (RCON_RCON_NVMLTA_Msk & (_UINT32_(value) << RCON_RCON_NVMLTA_Pos)) /* Assigment of value for NVMLTA in the RCON_RCON register */
#define   RCON_RCON_NVMLTA_NO_NVMLTA_Val      _UINT32_(0x0)                                        /* (RCON_RCON) A NVM LTA Error has not occurred.  */
#define   RCON_RCON_NVMLTA_NVMLTA_Val         _UINT32_(0x1)                                        /* (RCON_RCON) A NVM LTA Error has occurred.  */
#define RCON_RCON_NVMLTA_NO_NVMLTA            (RCON_RCON_NVMLTA_NO_NVMLTA_Val << RCON_RCON_NVMLTA_Pos) /* (RCON_RCON) A NVM LTA Error has not occurred. Position  */
#define RCON_RCON_NVMLTA_NVMLTA               (RCON_RCON_NVMLTA_NVMLTA_Val << RCON_RCON_NVMLTA_Pos) /* (RCON_RCON) A NVM LTA Error has occurred. Position  */
#define RCON_RCON_BCFGFAIL_Pos                _UINT32_(26)                                         /* (RCON_RCON) BCFG Failure Flag Bit Position */
#define RCON_RCON_BCFGFAIL_Msk                (_UINT32_(0x1) << RCON_RCON_BCFGFAIL_Pos)            /* (RCON_RCON) BCFG Failure Flag Bit Mask */
#define RCON_RCON_BCFGFAIL(value)             (RCON_RCON_BCFGFAIL_Msk & (_UINT32_(value) << RCON_RCON_BCFGFAIL_Pos)) /* Assigment of value for BCFGFAIL in the RCON_RCON register */
#define   RCON_RCON_BCFGFAIL_NO_BCFGFAIL_Val  _UINT32_(0x0)                                        /* (RCON_RCON) A BCFG Failure has not occurred.  */
#define   RCON_RCON_BCFGFAIL_BCFGFAIL_Val     _UINT32_(0x1)                                        /* (RCON_RCON) A BCFG Failure has occurred.  */
#define RCON_RCON_BCFGFAIL_NO_BCFGFAIL        (RCON_RCON_BCFGFAIL_NO_BCFGFAIL_Val << RCON_RCON_BCFGFAIL_Pos) /* (RCON_RCON) A BCFG Failure has not occurred. Position  */
#define RCON_RCON_BCFGFAIL_BCFGFAIL           (RCON_RCON_BCFGFAIL_BCFGFAIL_Val << RCON_RCON_BCFGFAIL_Pos) /* (RCON_RCON) A BCFG Failure has occurred. Position  */
#define RCON_RCON_BCFGERR_Pos                 _UINT32_(27)                                         /* (RCON_RCON) BCFG Error Flag Bit Position */
#define RCON_RCON_BCFGERR_Msk                 (_UINT32_(0x1) << RCON_RCON_BCFGERR_Pos)             /* (RCON_RCON) BCFG Error Flag Bit Mask */
#define RCON_RCON_BCFGERR(value)              (RCON_RCON_BCFGERR_Msk & (_UINT32_(value) << RCON_RCON_BCFGERR_Pos)) /* Assigment of value for BCFGERR in the RCON_RCON register */
#define   RCON_RCON_BCFGERR_NO_BCFGERR_Val    _UINT32_(0x0)                                        /* (RCON_RCON) A BCFG Error has not occurred.  */
#define   RCON_RCON_BCFGERR_BCFGERR_Val       _UINT32_(0x1)                                        /* (RCON_RCON) A BCFG Error has occurred.  */
#define RCON_RCON_BCFGERR_NO_BCFGERR          (RCON_RCON_BCFGERR_NO_BCFGERR_Val << RCON_RCON_BCFGERR_Pos) /* (RCON_RCON) A BCFG Error has not occurred. Position  */
#define RCON_RCON_BCFGERR_BCFGERR             (RCON_RCON_BCFGERR_BCFGERR_Val << RCON_RCON_BCFGERR_Pos) /* (RCON_RCON) A BCFG Error has occurred. Position  */
#define RCON_RCON_PORCORE_Pos                 _UINT32_(30)                                         /* (RCON_RCON) Core Voltage POR Flag bit Position */
#define RCON_RCON_PORCORE_Msk                 (_UINT32_(0x1) << RCON_RCON_PORCORE_Pos)             /* (RCON_RCON) Core Voltage POR Flag bit Mask */
#define RCON_RCON_PORCORE(value)              (RCON_RCON_PORCORE_Msk & (_UINT32_(value) << RCON_RCON_PORCORE_Pos)) /* Assigment of value for PORCORE in the RCON_RCON register */
#define   RCON_RCON_PORCORE_PORCORE_Val       _UINT32_(0x1)                                        /* (RCON_RCON) A Power-up Reset has occurred due to Core Voltage.  */
#define   RCON_RCON_PORCORE_NO_PORCORE_Val    _UINT32_(0x0)                                        /* (RCON_RCON) A Power-up Reset has not occurred due to Core Voltage.  */
#define RCON_RCON_PORCORE_PORCORE             (RCON_RCON_PORCORE_PORCORE_Val << RCON_RCON_PORCORE_Pos) /* (RCON_RCON) A Power-up Reset has occurred due to Core Voltage. Position  */
#define RCON_RCON_PORCORE_NO_PORCORE          (RCON_RCON_PORCORE_NO_PORCORE_Val << RCON_RCON_PORCORE_Pos) /* (RCON_RCON) A Power-up Reset has not occurred due to Core Voltage. Position  */
#define RCON_RCON_PORIO_Pos                   _UINT32_(31)                                         /* (RCON_RCON) IO Voltage POR Flag bit Position */
#define RCON_RCON_PORIO_Msk                   (_UINT32_(0x1) << RCON_RCON_PORIO_Pos)               /* (RCON_RCON) IO Voltage POR Flag bit Mask */
#define RCON_RCON_PORIO(value)                (RCON_RCON_PORIO_Msk & (_UINT32_(value) << RCON_RCON_PORIO_Pos)) /* Assigment of value for PORIO in the RCON_RCON register */
#define   RCON_RCON_PORIO_PORIO_Val           _UINT32_(0x1)                                        /* (RCON_RCON) A Power-up Reset has occurred due to IO Voltage.  */
#define   RCON_RCON_PORIO_NO_PORIO_Val        _UINT32_(0x0)                                        /* (RCON_RCON) A Power-up Reset has not occurred due to IO Voltage.  */
#define RCON_RCON_PORIO_PORIO                 (RCON_RCON_PORIO_PORIO_Val << RCON_RCON_PORIO_Pos)   /* (RCON_RCON) A Power-up Reset has occurred due to IO Voltage. Position  */
#define RCON_RCON_PORIO_NO_PORIO              (RCON_RCON_PORIO_NO_PORIO_Val << RCON_RCON_PORIO_Pos) /* (RCON_RCON) A Power-up Reset has not occurred due to IO Voltage. Position  */
#define RCON_RCON_Msk                         _UINT32_(0xCF0006FF)                                 /* (RCON_RCON) Register Mask  */


/* -------- RCON_RCONCLR : (RCON Offset: 0x34) (R/W 32)  -------- */
#define RCON_RCONCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RCONCLR)   Reset Value */

#define RCON_RCONCLR_Msk                      _UINT32_(0x00000000)                                 /* (RCON_RCONCLR) Register Mask  */


/* -------- RCON_RCONSET : (RCON Offset: 0x38) (R/W 32)  -------- */
#define RCON_RCONSET_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RCONSET)   Reset Value */

#define RCON_RCONSET_Msk                      _UINT32_(0x00000000)                                 /* (RCON_RCONSET) Register Mask  */


/* -------- RCON_RCONINV : (RCON Offset: 0x3C) (R/W 32)  -------- */
#define RCON_RCONINV_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RCONINV)   Reset Value */

#define RCON_RCONINV_Msk                      _UINT32_(0x00000000)                                 /* (RCON_RCONINV) Register Mask  */


